; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation8 - direction
	Star3 - direction
	Star7 - direction
	Star9 - direction
	Star0 - direction
	Star6 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite1 Planet12)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
))

)

; plan
1. (turn_to satellite2 star6 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 star6)
   goals met: 0 of 4
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (calibrate satellite2 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 0 of 4
4. (turn_to satellite2 planet11 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet11)
   goals met: 0 of 4
5. (turn_to satellite1 planet12 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet12)
   goals met: 1 of 4
6. (take_image satellite2 planet11 instrument2 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 4
7. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 2 of 4
8. (take_image satellite2 planet12 instrument2 image1)
   added: (have_image planet12 image1)
   goals met: 3 of 4
9. (turn_to satellite2 star10 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star10)
   goals met: 3 of 4
10. (take_image satellite2 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 4 of 4
